miniwinwm/miniwinwm/e2studio/MiniWinFile/RX65N/src/smc_gen/r_rtc_rx/src/r_rtc_rx_hw.c
    /* Restore the clock */
    rtc_counter_run(clock_state);

    return;
}
/**********************************************************************************************************************
End of function rtc_set_current_time
***********************************************************************************************************************/


/***********************************************************************************************************************
* Function Name: rtc_set_alarm_time
* Description  : This function disables all alarms in the ICU, sets the alarm date/time,
*                then restores the ICU alarms to its previous state.
* Arguments    : p_alarm
*                   - structure pointer to alarm date/time
* Return Value :
***********************************************************************************************************************/
void rtc_set_alarm_time (tm_t *p_alarm)
{
    uint8_t state;
    volatile uint8_t dummy_byte;
    volatile uint16_t dummy_word;
    volatile uint8_t i;

    state = IEN(RTC,ALM);
    IEN(RTC,ALM) = 0;

    /* Set time */
    /* Set seconds. (0-59) */
    RTC.RSECAR.BYTE &= 0x80u;
    for (i = 0; i < RTC_DUMMY_READ; i++)
    {
        dummy_byte = RTC.RSECAR.BYTE;
    }

    RTC.RSECAR.BYTE |= rtc_dec_to_bcd((uint8_t) p_alarm->tm_sec);
    for (i = 0; i < RTC_DUMMY_READ; i++)
    {
        dummy_byte = RTC.RSECAR.BYTE;
    }

    /* Set minutes (0-59) */
    RTC.RMINAR.BYTE &= 0x80u;
    for (i = 0; i < RTC_DUMMY_READ; i++)
    {
        dummy_byte = RTC.RMINAR.BYTE;
    }

    RTC.RMINAR.BYTE |= rtc_dec_to_bcd((uint8_t) p_alarm->tm_min);
    for (i = 0; i < RTC_DUMMY_READ; i++)
    {
        dummy_byte = RTC.RMINAR.BYTE;
    }

    /* Set hours. (0-23) */
    RTC.RHRAR.BYTE &= 0x80u;
    for (i = 0; i < RTC_DUMMY_READ; i++)
    {
        dummy_byte = RTC.RHRAR.BYTE;
    }

    RTC.RHRAR.BYTE |= rtc_dec_to_bcd((uint8_t) p_alarm->tm_hour);
    for (i = 0; i < RTC_DUMMY_READ; i++)
    {
        dummy_byte = RTC.RHRAR.BYTE;
    }

    /* Set the date */
    /* Day of the week (0-6, 0=Sunday) */
    RTC.RWKAR.BYTE &= 0x80u;
    for (i = 0; i < RTC_DUMMY_READ; i++)
    {
        dummy_byte = RTC.RWKAR.BYTE;
    }

    RTC.RWKAR.BYTE |= rtc_dec_to_bcd((uint8_t) p_alarm->tm_wday);
    for (i = 0; i < RTC_DUMMY_READ; i++)
    {
        dummy_byte = RTC.RWKAR.BYTE;
    }

    /* Day of the month (1-31) */
    RTC.RDAYAR.BYTE &= 0x80u;
    for (i = 0; i < RTC_DUMMY_READ; i++)
    {
        dummy_byte = RTC.RDAYAR.BYTE;
    }

    RTC.RDAYAR.BYTE |= rtc_dec_to_bcd((uint8_t) p_alarm->tm_mday);
    for (i = 0; i < RTC_DUMMY_READ; i++)
    {
        dummy_byte = RTC.RDAYAR.BYTE;
    }

    /* Month. (1-12, 1=January) */
    RTC.RMONAR.BYTE &= 0x80u;
    for (i = 0; i < RTC_DUMMY_READ; i++)
    {
        dummy_byte = RTC.RMONAR.BYTE;
    }

    RTC.RMONAR.BYTE |= rtc_dec_to_bcd((uint8_t) (p_alarm->tm_mon + 1));
    for (i = 0; i < RTC_DUMMY_READ; i++)
    {
        dummy_byte = RTC.RMONAR.BYTE;
    }

    /* Year. (00-99) */
    RTC.RYRAR.WORD = (uint16_t) (rtc_dec_to_bcd((uint8_t) ((p_alarm->tm_year + 1900) % 100)));
    for (i = 0; i < RTC_DUMMY_READ; i++)
    {
        dummy_word = RTC.RYRAR.WORD;
    }

    IEN(RTC,ALM) = state;
    return;
}
/**********************************************************************************************************************
End of function rtc_set_alarm_time
***********************************************************************************************************************/


/***********************************************************************************************************************
* Function Name: rtc_enable_alarms
* Description  : This function sets the alarm bit for each available alarm field.
* Arguments    : p_alm_ctrl
*                   - pointer to alarm control structure
* Return Value : None
***********************************************************************************************************************/
void rtc_enable_alarms (rtc_alarm_ctrl_t *p_alm_ctrl)
{
    IEN(RTC,ALM) = 0;

    /* Alarm time enable setting */
    RTC.RSECAR.BIT.ENB  = (uint8_t)((true == p_alm_ctrl->sec) ? 1 : 0);
    RTC.RMINAR.BIT.ENB  = (uint8_t)((true == p_alm_ctrl->min) ? 1 : 0);
    RTC.RHRAR.BIT.ENB   = (uint8_t)((true == p_alm_ctrl->hour) ? 1 : 0);
    RTC.RDAYAR.BIT.ENB  = (uint8_t)((true == p_alm_ctrl->mday) ? 1 : 0);
    RTC.RMONAR.BIT.ENB  = (uint8_t)((true == p_alm_ctrl->mon) ? 1 : 0);
    RTC.RYRAREN.BIT.ENB = (uint8_t)((true == p_alm_ctrl->year) ? 1 : 0);
    RTC.RWKAR.BIT.ENB   = (uint8_t)((true == p_alm_ctrl->wday) ? 1 : 0);

    if (1 == RTC.RWKAR.BIT.ENB) // dummy read for waiting until set the value of RTC
    {
        nop();
    }

    /* Alarm time setting definite waiting */
    R_BSP_SoftwareDelay((uint32_t)16, (bsp_delay_units_t)BSP_DELAY_MILLISECS);  //Approx.16ms (1/64Hz = 15.625ms)

    IR(RTC,ALM)  = 0;
    IPR(RTC,ALM) = p_alm_ctrl->int_priority;
    IEN(RTC,ALM) = 1;

    return;
}
/**********************************************************************************************************************
End of function rtc_enable_alarms
***********************************************************************************************************************/


#if !defined(BSP_MCU_RX11_ALL) && !defined(BSP_MCU_RX130)
/***********************************************************************************************************************
* Function Name: rtc_config_capture
* Description  : This function configures the capture facility for the specified pin.
* Arguments    : p_capture
*                   - pointer to configuration structure (already checked for valid data)
* Return Value : None
***********************************************************************************************************************/
void rtc_config_capture (rtc_capture_cfg_t *p_capture)
{
    uint8_t byte;

    /*  The time capture event input enable */
    g_pcap_ctrl[p_capture->pin].rtccr = RTC_CAPTURE_ENABLE_MASK;
    while (RTC_CAPTURE_ENABLE_MASK != g_pcap_ctrl[p_capture->pin].rtccr)
    {
        /* Confirm that it has changed */
        nop();
    }

    /* Noise Filter setting */
    byte = (uint8_t) (((uint8_t) p_capture->filter) << 4);
    g_pcap_ctrl[p_capture->pin].rtccr |= byte;
    while ((g_pcap_ctrl[p_capture->pin].rtccr & 0x30) != byte)
    {
        /* Confirm that it has changed */
        nop();
    }

    /* Waiting for noise filter set time. */
    if (RTC_FILTER_DIV1 == p_capture->filter)
    {
        /* 3 period of the sampling period is 91.5us. (Approx. 92us) */
        R_BSP_SoftwareDelay((uint32_t) 92, (bsp_delay_units_t) BSP_DELAY_MICROSECS);
    }
    else if (RTC_FILTER_DIV32 == p_capture->filter)
    {
        /* 3 period of the sampling period is 2.92ms. (Approx. 3ms) */
        R_BSP_SoftwareDelay((uint32_t) 3, (bsp_delay_units_t) BSP_DELAY_MILLISECS);
    }
    else
    {
        /* RTC_FILTER_OFF */
    }

    /*  Edge detection setting */
    byte = (uint8_t) (p_capture->edge);
    g_pcap_ctrl[p_capture->pin].rtccr |= byte;
    while ((g_pcap_ctrl[p_capture->pin].rtccr & 0x03) != byte)
    {
        /* Confirm that it has changed */
        nop();
    }

    return;
}
/**********************************************************************************************************************
End of function rtc_config_capture
***********************************************************************************************************************/


