miniwinwm/miniwinwm/e2studio/MiniWinFile/RX65N/src/smc_gen/r_rtc_rx/src/r_rtc_rx_hw.c
/***********************************************************************************************************************
* Function Name: rtc_check_capture
* Description  : This function checks to see if a capture event has occurred.
*                If yes, the time of the event is loaded.
* Arguments    : pin
*                   - pin number to check event on (RTCIC0, RTCIC1 or RTCIC2)
*                p_time
*                   - pointer to time structure to load date/time into if event occurred
* Return Value : RTC_SUCCESS
*                   - capture event detected; time retrieved
*                RTC_ERR_NO_CAPTURE
*                   - capture event not detected
*                RTC_ERR_BAD_PARAM
*                   - invalid pin number
***********************************************************************************************************************/
rtc_err_t rtc_check_capture (rtc_pin_t pin, tm_t *p_time)
{
    volatile rtc_cap_time_t *pregs;
    uint8_t tmp;

#if (RTC_CFG_PARAM_CHECKING_ENABLE)
    if (pin >= RTC_NUM_PINS)
    {
        return RTC_ERR_BAD_PARAM;
    }
#endif

    if (g_pcap_ctrl[pin].rtccr & RTC_CAPTURE_EVENT_MASK)
    {
        pregs = &g_pcap_time[pin];

        tmp = (uint8_t) (g_pcap_ctrl[pin].rtccr & (~RTC_CAPTURE_EVENT_MASK)); //Save settings

        /* Event detection disable */
        g_pcap_ctrl[pin].rtccr &= (~RTC_CAPTURE_EDGE_MASK);

        /* READ TIME */
        /* mask off unknown bits and hour am/pm field */
        p_time->tm_sec  = rtc_bcd_to_dec((uint8_t) (pregs->rseccp & 0x7F));
        p_time->tm_min  = rtc_bcd_to_dec((uint8_t) (pregs->rmincp & 0x7F));
        p_time->tm_hour = rtc_bcd_to_dec((uint8_t) (pregs->rhrcp & 0x3F));
        p_time->tm_mday = rtc_bcd_to_dec((uint8_t) (pregs->rdaycp & 0x3F));
        p_time->tm_mon  = rtc_bcd_to_dec(pregs->rmoncp) - 1;


        /* CLEAR EVENT (must be loop) */
        do
        {
            g_pcap_ctrl[pin].rtccr &= (~RTC_CAPTURE_EVENT_MASK);
        } while (0 != (g_pcap_ctrl[pin].rtccr & RTC_CAPTURE_EVENT_MASK));

        g_pcap_ctrl[pin].rtccr = tmp;                //write back settings
        while ((g_pcap_ctrl[pin].rtccr & (~RTC_CAPTURE_EVENT_MASK)) != tmp)
        {
            /* Confirm that it has changed */
            nop();
        }

        return RTC_SUCCESS;
    }
    else
    {
        return RTC_ERR_NO_CAPTURE;
    }
}
/**********************************************************************************************************************
End of function rtc_check_capture
***********************************************************************************************************************/


/***********************************************************************************************************************
* Function Name: rtc_disable_capture
* Description  : This function disables the capture facility for the specified pin.
* Arguments    : pin
*                   - pin number to disable capture for (0, 1, 2)
* Return Value : None
***********************************************************************************************************************/
void rtc_disable_capture (rtc_pin_t pin)
{

    /* valid pin checked prior to entry */
    g_pcap_ctrl[pin].rtccr = 0;

    while (0 != g_pcap_ctrl[pin].rtccr)
    {
        /* Confirm that it has changed */
        nop();
    }
}
/**********************************************************************************************************************
End of function rtc_disable_capture
***********************************************************************************************************************/

#endif /* not RX11x, RX130 */


/***********************************************************************************************************************
* Function Name: rtc_read_current
* Description  : This function retrieves the current date/time. If a carry interrupt is detected
*                (occurs on a second interval) while reading the values are read again.
* Arguments    : p_current
*                   - pointer to time structure for loading current date/time
* Return Value : None
***********************************************************************************************************************/
void rtc_read_current (tm_t *p_current)
{

    uint16_t bcd_years; // Used for converting year.

    do
    {
        /* Clear carry flag in ICU */
        ICU.IR[IR_RTC_CUP].BIT.IR = 0;

        /* Read and convert RTC registers; mask off unknown bits and hour am/pm. */
        /* Seconds. (0-59) */
        p_current->tm_sec  = rtc_bcd_to_dec((uint8_t) (RTC.RSECCNT.BYTE & 0x7fu));

        /* Minutes. (0-59) */
        p_current->tm_min  = rtc_bcd_to_dec((uint8_t) (RTC.RMINCNT.BYTE & 0x7fu));

        /* Hours. (0-23) */
        p_current->tm_hour = rtc_bcd_to_dec((uint8_t) (RTC.RHRCNT.BYTE & 0x3fu));

        /* Day of the month (1-31) */
        p_current->tm_mday = rtc_bcd_to_dec(RTC.RDAYCNT.BYTE);

        /* Months since January (0-11) */
        p_current->tm_mon  = rtc_bcd_to_dec(RTC.RMONCNT.BYTE) - 1;

        /* Years since 2000 */
        bcd_years = (uint16_t) RTC.RYRCNT.WORD;

        /* years years since 1900 (100-199) */
        p_current->tm_year = rtc_bcd_to_dec((uint8_t) (bcd_years & 0xFF)) + 100;

        /* Days since Sunday (0-6) */
        p_current->tm_wday = (int) (RTC.RWKCNT.BYTE & 0x07u);

    } while (1 == ICU.IR[IR_RTC_CUP].BIT.IR); //Reread if carry occurs during read

    return;
}
/**********************************************************************************************************************
End of function rtc_read_current
***********************************************************************************************************************/


/***********************************************************************************************************************
* Function Name: rtc_read_alarm
* Description  : This function reads the alarm date/time and clears the alarm interrupt flag.
* Arguments    : p_alarm
*                   - time structure pointer for loading alarm date/time
* Return Value : None
***********************************************************************************************************************/
void rtc_read_alarm (tm_t *p_alarm)
{
    /* Used for converting year. */
    uint16_t bcd_years;

    /* Clear flag in ICU */
    ICU.IR[IR_RTC_CUP].BIT.IR = 0;

    /* Read and convert RTC registers; mask off unknown bits and hour am/pm. */
    /* Seconds. (0-59) */
    p_alarm->tm_sec  = rtc_bcd_to_dec((uint8_t) (RTC.RSECAR.BYTE & 0x7fu));

    /* Minutes. (0-59) */
    p_alarm->tm_min  = rtc_bcd_to_dec((uint8_t) (RTC.RMINAR.BYTE & 0x7fu));

    /* Hours. (0-23) */
    p_alarm->tm_hour = rtc_bcd_to_dec((uint8_t) (RTC.RHRAR.BYTE & 0x3fu));

