miniwinwm/miniwinwm/e2studio/MiniWinFile/RX65N/src/smc_gen/r_rtc_rx/src/r_rtc_rx_hw.c
    /* Day of the month (1-31) */
    p_alarm->tm_mday = rtc_bcd_to_dec((uint8_t) (RTC.RDAYAR.BYTE & 0x3fu));

    /* Months since January (0-11) */
    p_alarm->tm_mon  = rtc_bcd_to_dec((uint8_t) (RTC.RMONAR.BYTE & 0x1fu)) - 1;

    /* Years since 2000 (100-199)*/
    bcd_years = (uint16_t) RTC.RYRAR.WORD;

    /* RTC only supports years 0-99; years since 1900 */
    p_alarm->tm_year = rtc_bcd_to_dec((uint8_t) (bcd_years & 0xFF)) + 100;

    /* Days since Sunday (0-6) */
    p_alarm->tm_wday = (int) (RTC.RWKAR.BYTE & 0x07u);

    return;
}
/**********************************************************************************************************************
End of function rtc_read_alarm
***********************************************************************************************************************/


/***********************************************************************************************************************
* Function Name: rtc_counter_run
* Description  : Starts or stops the RTC counter.
* Arguments    : action
*                   - 0 to stop, 1 to start
* Return Value : None
***********************************************************************************************************************/
void rtc_counter_run (const uint8_t action)
{

    /* START bit is updated in synchronization with the next count source. */
    while (RTC.RCR2.BIT.START != action)
    {
        RTC.RCR2.BIT.START = action;
    }

    return;
}
/**********************************************************************************************************************
End of function rtc_counter_run
***********************************************************************************************************************/


/***********************************************************************************************************************
* Function Name: rtc_reset
* Description  : This function sets the RTC Software Reset bit and waits for the reset to complete.
*                The reset affects the output clock enable, alarm and capture registers.
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
void rtc_reset (void)
{

    RTC.RCR2.BIT.RESET = 1;

    while (0 != RTC.RCR2.BIT.RESET)
    {
        /* Wait for reset to happen before continuing.*/
        nop();
    }

    return;
}
/**********************************************************************************************************************
End of function rtc_reset
***********************************************************************************************************************/


/***********************************************************************************************************************
* Function Name: rtc_disable_ints
* Description  : This function disables the RTC and ICU interrupts.
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
void rtc_disable_ints (void)
{

    /* Disable ICU interrupts */
    IEN(RTC,PRD) = 0;
    IEN(RTC,ALM) = 0;
    IEN(RTC,CUP) = 0;

    /* Disable RTC interrupts */
    while ((RTC.RCR1.BYTE & RTC_INT_MASK) != 0)
    {
        RTC.RCR1.BYTE &= (~RTC_INT_MASK);
    }

    /* Clear interrupts request flag */
    IR(RTC,PRD) = 0;
    IR(RTC,ALM) = 0;
    IR(RTC,CUP) = 0;

    return;
}
/**********************************************************************************************************************
End of function rtc_disable_ints
***********************************************************************************************************************/


/***********************************************************************************************************************
* Function Name: rtc_enable_ints
* Description  : This function enables the RTC interrupts.
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
void rtc_enable_ints (void)
{

    /* Enable RTC interrupts (PIE, CIE and AIE), not ICU yet */
    RTC.RCR1.BYTE = RTC_INT_ENABLE;
    while (RTC_INT_ENABLE != RTC.RCR1.BYTE)
    {
        /* Confirm that it has changed */
        nop();
    }

    return;
}
/**********************************************************************************************************************
End of function rtc_enable_ints
***********************************************************************************************************************/

